"""
@File : 3冒泡排序.py
@Author : 王子墨
@Description : 
@Date :2026/9/13
案例：演示冒泡排序。

冒泡排序介绍：

原理：
相邻元素两两比较，大的往后走，这样第一轮比较完毕后，最大值就在最大索引处。
重复此动作，直至排序完成。

流程：假设共 5 个元素

第几轮(索引) 该轮比较的总次数    公式
第1轮(0)：     4次          5 - 1 - 0 = 4
第2轮(1)：     3次          5 - 1 - 1 = 3
第3轮(2)：     2次          5 - 1 - 2 = 2
第4轮(3)：     1次          5 - 1 - 3 = 1

要点：

1.比较的总轮数。       列表长度 - 1
2.每轮比较的总次数。    列表长度 - 1 - 轮数的索引(从0开始)
3.和谁比较。          索引 j 和 j + 1位置的元素比较

时间复杂度：
    最优：O(n)
    最坏：O(n**2)

扩展：
    冒泡排序 = 稳定排序算法
    外循环的 -1 是什么意思:减少比较的轮数，提高效率
    内循环的 -1 是什么意思:为了防止索引 越界
    内循环的 -i 是什么意思:减少每轮比较的次数，提高效率
"""

list = [5,3,6,7,2]
# list = [2,3,5,6,7]

#形参接受可变类型，形参的改变直接影响实参
def bubble_sort(list):
    #列表长度
    n = len(list)
    #交换次数
    count = 0
    #控制比较的轮数
    for i in range(n-1):
        #控制每轮比较的总次数
        for j in range(n-1-i):
            if list[j] > list[j+1]:
                list[j+1],list[j] = list[j],list[j+1]
                count += 1
        print(f"第{i+1}轮交换了{count}次")
        if count == 0:
            break
if __name__ == "__main__":
    bubble_sort(list)
    print(list)